<?php
namespace DerrikeG\Mute8\Mutators\Dictionaries;
use DerrikeG\Mute8\Genomes\Mutator;

/**
 * Class Flip
 * @package DerrikeG\Mute8
 */
class Flip extends Mutator{
	/**
	 * @var array
     */
	protected $dictionary = [
		'A' => '∀',
		'B' => '8',//!
		'C' => 'Ͻ',
		'D' => 'ᗡ',
		'E' => 'Ǝ',
		'F' => 'Ⅎ',
		'G' => '9',//!
		//*H
		//*I
		'J' => 'ſ',
		'K' => 'ʞ',//!
		'L' => '˥',
		'M' => 'W',
		//*N
		//*O
		'P' => 'Ԁ',
		'Q' => 'Ὁ',
		'R' => 'ᴚ',
		//*S
		'T' => '⊥',
		'U' => '∩',
		'V' => 'Λ',
		'W' => 'M',
		//*X
		'Y' => 'ʎ',//!
		//*Z
		'a' => 'ɐ',
		'b' => 'q',
		'c' => 'ɔ',
		'd' => 'p',
		'e' => 'ǝ',
		'f' => 'ɟ',
		'g' => 'ƃ',
		'h' => 'ɥ',
		'i' => 'ı',
		'j' => 'ɾ',
		'k' => 'ʞ',
		'l' => 'ן',
		'm' => 'ɯ',
		'n' => 'u',
		//*o
		'p' => 'd',
		'q' => 'b',
		'r' => 'ɹ',
		//*s
		't' => 'ʇ',
		'u' => 'n',
		'v' => 'ʌ',
		'w' => 'ʍ',
		//*x
		'y' => 'ʎ',
		//*z
		'?' => '¿',
		'!' => '¡',
		'.' => '˙',
		'[' => ']',
		'(' => ')',
		'{' => '}',
		"'" => ',',
		'<' => '>',
		'"' => '„',
		'_' => '‾',
		';' => '؛',
		'1' => '⇂',
		'2' => 'ᄅ',
		'3' => 'Ɛ',
		'4' => 'ᔭ',
		'5' => 'ㄣ',
		'6' => '9',
		'7' => 'Ɫ',
		'‿' => '⁀',
		'⁅' => '⁆',
		'∴' => '∵'
	];
}