<?php
namespace DerrikeG\Mute8\Mutators\WeightedDictionaries;
use DerrikeG\Mute8\Genomes\Mutators\WeightedDictionary;

/**
 * Class Wave
 * @package DerrikeG\Mute8
 */
class Wave extends WeightedDictionary{
    /**
     * @var array
     */
    protected $dictionary = [
		'A' => 'ᗩ',
		'B' => ['ᙖ','ᗷ'],
		'C' => ['ᑕ','ᙅ'],
		'D' => ['ᗪ','ↁ'],
		'E' => 'ᕮ',
		'F' => 'ℱ',
		'G' => 'ᘐ',
		'H' => 'ᕼ',
		'I' => ['ᓰ','ᓮ'],
		'J' => 'ᒎ',
		'K' => 'Ḱ',
		'L' => 'ᒪ',
		'M' => ['ᗰ','ᙢ'],
		'N' => 'ᘉ',
		'O' => '〇',
		'P' => ['ᑭ','ᖘ'],
		'Q' => 'Ⴓ',
		'R' => 'ᖇ',
		'S' => 'ᔕ',
		'T' => ['♈','☂'],
		'U' => ['ᑌ','ᘮ','ᕰ'],
		'V' => ['ᐯ','ᐯ','Ⅴ'],
		'W' => ['ᗯ','ᙡ'],
		'X' => ['᙭','Ꮖ'],
		'Y' => ['ϒ','Ꭹ'],
		'Z' => 'ᔓ',
		'a' => 'ᗩ',//!
		'b' => ['ᖲ','ᕊ'],
		'c' => ['ᑕ','ᙅ'],//!
		'd' => ['ᖱ','ᕍ','ᖙ'],
		'e' => ['ᗴ','ᙓ'],
		'f' => 'ℱ',//!
		'g' => 'ᘐ',//!
		'h' => 'ᖺ',
		'i' => ['ᓰ','ᓮ'],//!
		'j' => 'ᒎ',//!
		'k' => 'Ḱ',//!
		'l' => 'ᒪ',//!
		'm' => ['ᗰ','ᙢ'],//!
		'n' => 'ﬡ',
		'o' => ['ᗢ','ᗝ'],
		'p' => ['ᖰ','ᕈ'],
		'q' => ['ᕴ','ᖳ','ᕋ'],
		'r' => 'ᖇ',//!
		's' => 'ᔕ',//!
		't' => ['♈','☂'],//!
		'u' => ['ᘮ','⋒','ᘎ'],
		'v' => ['ᐯ','ᐯ','Ⅴ'],//!
		'w' => ['ᗯ','ᙡ'],//!
		'x' => 'ჯ',
		'y' => ['Ꭹ','૪'],
		'z' => 'ᔓ'//!
	];
}